In [1]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="pruebas",
  password="pruebas123",
  database="PabloLLC"
)

In [2]:
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('checkpoint_m2',)
('henry',)
('information_schema',)
('mysql',)
('pablollc',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [3]:
mycursor.execute("SHOW TABLES")
for x in mycursor:
  print(x[0])

canaldeventa
cliente
compra
empleado
gasto
producto
proveedor
sucursal
tipodegasto
venta

In [18]:
import pandas as pd
proveedores = pd.read_excel('Proveedores.xlsx', index_col=0)
proveedores.head()

,Nombre,Address,City,State,Country,departamen
IDProveedor,,,,,,
1,NaN,BEREGUESTEIN 36,AVELLANEDA,BUENOS AIRES,ARGENTINA,AVELLANEDA
2,San Cirano,ALBERTI 965,CORONEL BRANDSEN,BUENOS AIRES,ARGENTINA,BRANDSEN
3,Bell S.A.,MORENO 331,CAMPANA,BUENOS AIRES,ARGENTINA,CAMPANA
4,Rivero Insumos,PTE. PERON 3872,VALENTIN ALSINA,BUENOS AIRES,ARGENTINA,LANUS
5,Laprida Computacion,AVDA. PEDRO PEREYRA 1339,LAPRIDA,BUENOS AIRES,ARGENTINA,LAPRIDA

In [30]:
from sqlalchemy import create_engine
import pymysql

sqlEngine = create_engine('mysql+pymysql://pruebas:pruebas123@127.0.0.1/pablollc', pool_recycle=3600)
dbConnection = sqlEngine.connect()
tableName = 'proveedor'

try:
    frame = proveedores.to_sql(tableName, dbConnection, if_exists='replace')
except ValueError as vx:
    print(vx)
except Exception as ex:   
    print(ex)
else:
    print("Table %s created successfully."%tableName);   
finally:
    dbConnection.close()

Table proveedor created successfully.

In [31]:
empleados = pd.read_excel('Empleados.xls', index_col=0)
empleados.head()

,Apellido,Nombre,Sucursal,Sector,Cargo,Salario
ID_empleado,,,,,,
1968,Burgos,Jeronimo,Caseros,Administración,Administrativo,32000
1674,Villegas,Estefania,Caseros,Administración,Vendedor,32000
1516,Fernandez,Guillermo,Caseros,Administración,Vendedor,45000
1330,Ramirez,Eliana,Caseros,Administración,Vendedor,32000
1657,Carmona,Jose,Caseros,Administración,Vendedor,32000

In [32]:
sqlEngine = create_engine('mysql+pymysql://pruebas:pruebas123@127.0.0.1/pablollc', pool_recycle=3600)
dbConnection = sqlEngine.connect()
tableName = 'empleado'

try:
    frame = empleados.to_sql(tableName, dbConnection, if_exists='replace')
except ValueError as vx:
    print(vx)
except Exception as ex:   
    print(ex)
else:
    print("Table %s created successfully."%tableName);   
finally:
    dbConnection.close()

Table empleado created successfully.

In [4]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql

clientes = pd.read_csv('Clientes.csv',delimiter=';',index_col=0)
clientes.head()

,Provincia,Nombre_y_Apellido,Domicilio,Telefono,Edad,Localidad,X,Y,col10
ID,,,,,,,,,
1,Buenos Aires,HEBER JONI SANTANA,LAS HERAS Y BAT. 24 DE FEBRERO 4150 RINCON DE...,42-5161,58,LOMA VERDE,"-58,81850307","-34,30997088",NaN
2,Buenos Aires,ANA SAPRIZA,PUEYRREDON Y DUPUY RUTA3 KM 52.500 S/N BÂº LO...,49-7578,61,SANTA ROSA,"-58,73073751","-34,93908311",NaN
3,Buenos Aires,FERNANDO LUIS SARALEGUI,CALDERON DE LA BARCA 498,49-3435,15,TORRES,"-59,12794068","-34,43082199",NaN
4,Buenos Aires,MANUELA SARASOLA,"RUTA 36 KM 45,500 S/N EL PELIGRO",49-2883,29,RUTA SOL,"-58,14393954","-34,92052706",NaN
5,Buenos Aires,MARIO RAÚL SARASUA,492 Y 186 S/N COLONIA URQUIZA,491-4608,34,JOSE MELCHOR ROMERO,"-58,089381","-34,9444471",NaN

In [ ]:
sqlEngine = create_engine('mysql+pymysql://pruebas:pruebas123@127.0.0.1/pablollc', pool_recycle=3600)
dbConnection = sqlEngine.connect()
tableName = 'cliente'

try:
    frame = clientes.to_sql(tableName, dbConnection, if_exists='replace')
except ValueError as vx:
    print(vx)
except Exception as ex:   
    print(ex)
else:
    print("Table %s created successfully."%tableName);   
finally:
    dbConnection.close()